EmbeddedSystemClass/STM32F746G_Base/Core/Src/main.cpp
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
	/* Graphic application */
	GRAPHICS_MainTask();
	/* USER CODE BEGIN 5 */
	/* Infinite loop */
	for(;;)
	{
		osDelay(1);
	}
	/* USER CODE END 5 */
}

/* USER CODE BEGIN Header_dummyTask */
/**
 * @brief Function implementing the dummy thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_dummyTask */
void dummyTask(void const * argument)
{
	/* USER CODE BEGIN dummyTask */
	static uint32_t count = 0;
	/* Infinite loop */
	for(;;)
	{
		BSP_CLI_Printf("[%ld] Heap: size = %ld, min: %ld\r\n", count++, xPortGetFreeHeapSize(), xPortGetMinimumEverFreeHeapSize());
		osDelay(1000);
	}
	/* USER CODE END dummyTask */
}

/* USER CODE BEGIN Header_StartSDTask */
/**
 * @brief Function implementing the sdTask thread.
 * @param argument: Not used
 * @retval None
 */

FATFS SDFatFs;  /* File system object for SD card logical drive */
#define DBG_FATFS BSP_CLI_Printf
#define DBG_QUEUE BSP_CLI_Printf

/* USER CODE END Header_StartSDTask */
void StartSDTask(void const * argument)
{
	/* USER CODE BEGIN StartSDTask */
	FRESULT fr;                                 /* FatFs function common result code */
	FATFS* fs = &SDFatFs;                       /* File system object for SD card logical drive */
	uint8_t ret = 0;
	uint32_t rng_value = 0;

	uint8_t state = 0;
	uint8_t state_new = 0;

	uint8_t ucSDState_cur = 0;
	uint8_t ucSDState_old = 0;

	/* Queue PV */
	uint8_t queueData = 0;

	/* Infinite loop */
	for(;;)
	{
		if (state != state_new)
		{
			DBG_FATFS("State transition (%d >> %d)\r\n", state, state_new);
			state = state_new;
		}

		switch(state){
		case 0:
		{
			MX_FATFS_Init();
			ret = BSP_SD_Init();
			if(ret == MSD_OK)
			{
				/*##-2- Register the file system object to the FatFs module ##############*/
				fr = f_mount(fs, (TCHAR const*)SDPath, 0);
				if(fr != FR_OK)
				{
					DBG_FATFS("f_mount (fr = %d)\r\n",  fr);
				}
				else
				{
					FIL fil;
					uint32_t ulBytesWritten = 0;
					const char* scText = "Hello world!";
					const char* scFile = "DUMMY.TXT";

					/* Open log file */
					fr = f_open(&fil, scFile, FA_CREATE_ALWAYS | FA_WRITE);
					if(fr == FR_OK)
					{
						fr = f_write(&fil, (void*)scText, strlen(scText), (UINT *)&ulBytesWritten);
						if(fr == FR_OK)
						{
							if (ulBytesWritten != strlen(scText))
							{
								DBG_FATFS("fr = %d, size mismatch (%ld != %ld)\r\n", fr, ulBytesWritten, strlen(scText));
							}
							else
							{
								DBG_FATFS("Text Written: %s\r\n", scText);
								DBG_FATFS("Bytes Written: %ld\r\n", ulBytesWritten);
							}
						}
						else
						{
							DBG_FATFS("f_write (fr = %d)\r\n",  fr);
						}

						f_close(&fil);
					}

					state_new = 1;
				}
			}
			else if(ret == MSD_ERROR_SD_NOT_PRESENT)
			{
				// DBG_FATFS("SD is Not Detected (state = %d)\r\n",  ucSDState_cur);
			}
			else
			{
				DBG_FATFS("BSP_SD_Init (ret = %d)\r\n",  ret);
			}
		}
		break;
		case 1:
		{
			/* Check if the SD card is plugged in the slot */
			ucSDState_cur = BSP_SD_IsDetected();
			if (ucSDState_cur != SD_PRESENT)
			{
				if(ucSDState_old != SD_NOT_PRESENT)
				{
					ucSDState_old = SD_NOT_PRESENT;
					state_new = 2;
					DBG_FATFS("SD is Not Detected (state = %d)\r\n",  ucSDState_cur);
				}
			}
			else
			{
				if(ucSDState_old != SD_PRESENT)
				{
					ucSDState_old = SD_PRESENT;
					DBG_FATFS("SD has been Detected (state = %d)\r\n",  ucSDState_old);
				}
			}
		}
		break;
		case 2:
		{
			/* Teardown */
			DBG_FATFS("Teardown (state = %d)\r\n", state);
			state_new = 0;
		}
		break;
		default:
			break;
		}

		osDelay(100);
	}
	/* USER CODE END StartSDTask */
}

/* USER CODE BEGIN Header_HTTP_Client_Task */
/**
 * @brief Function implementing the clientTask thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_HTTP_Client_Task */
void HTTP_Client_Task(void const * argument)
{
	/* USER CODE BEGIN HTTP_Client_Task */
	RTOS_TASK_START();

	/* wait for other tasks to start */
	osDelay(100);

	/* Queue PV */
	uint8_t queueData = 0;
	lwhttp_message_header_t* content_type_header_ptr;

	static lwhttp_request_t client_request;
	static lwhttp_response_t client_response;
	BaseType_t xResultHTTP = pdFAIL;

	/* LwIP PV */
	struct netif* netif = (struct netif*)argument;
	ip_addr_t ipaddr;
	ip_addr_t netmask;
	ip_addr_t gw;
	struct dhcp *dhcp;

	/* init code for LWIP */
	MX_LWIP_Init();

	RTOS_TASK_READY();
	//DBG_RTOS("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());

	/* Infinite loop */
	for(;;)
	{
		switch (DHCP_state)
		{
		case DHCP_OFF:
		{
			/* Check interface status */
			if (netif_is_up(netif))
			{
				setDHCP_State(DHCP_START);
			}
			else
			{
				osDelay(100);
			}
		}
		break;
		case DHCP_START:
		{
			ip_addr_set_zero_ip4(&netif->ip_addr);
			ip_addr_set_zero_ip4(&netif->netmask);
			ip_addr_set_zero_ip4(&netif->gw);
			dhcp_start(netif);
			setDHCP_State(DHCP_WAIT_ADDRESS);
			DBG_DHCP("Looking for server\r\n");
		}
		break;
		case DHCP_WAIT_ADDRESS:
		{
			if (dhcp_supplied_address(netif))
			{
				setDHCP_State(DHCP_ADDRESS_ASSIGNED);
				DBG_DHCP("Dynamic IP address (%s)\r\n", ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));
			}
			else
			{
				dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);

				/* DHCP timeout */
				if (dhcp->tries > MAX_DHCP_TRIES)
				{
					setDHCP_State(DHCP_TIMEOUT);

					/* Stop DHCP */
					dhcp_stop(netif);

					/* Static address used */
					IP_ADDR4(&ipaddr, IP_ADDR0 ,IP_ADDR1 , IP_ADDR2 , IP_ADDR3 );
					IP_ADDR4(&netmask, NETMASK_ADDR0, NETMASK_ADDR1, NETMASK_ADDR2, NETMASK_ADDR3);
					IP_ADDR4(&gw, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
					netif_set_addr(netif, ip_2_ip4(&ipaddr), ip_2_ip4(&netmask), ip_2_ip4(&gw));

