EmbeddedSystemClass/STM32F746G_Base/Core/Src/main.cpp
					DBG_DHCP("Timeout\r\n");
					DBG_DHCP("Static IP address (%s)\r\n", ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));
				}
			}
		}
		break;
		case DHCP_LINK_DOWN:
		{
			/* Stop DHCP */
			dhcp_stop(netif);
			setDHCP_State(DHCP_OFF);
		}
		break;
		case DHCP_ADDRESS_ASSIGNED:
		{
#if 0
			if(xQueueReceive(tcpQueueHandle, &queueData, 0) == pdTRUE)
			{
				DBG_QUEUE("tcpQueueHandle: %d\r\n", queueData);

				sd_log_entry_t xEntry;

				if (FR_OK == sd_log_entry_get_pending(&xEntry))
				{
					queueData = (uint8_t)xEntry.ulData;
				}
				else
				{
					DBG_LWIP("Failed to get pending!\r\n");
				}

				/* LwHTTP Inits */
				lwhttp_request_init(&client_request);
				lwhttp_response_init(&client_response);

				/* Sen POST request */
				if (pdTRUE == post_thingspeak(&client_request, &client_response, queueData))
				{
					/* Run LwHTTP Request Parser */
					xResultHTTP = lwhttp_request_parse(&client_request);
					if (pdTRUE != xResultHTTP)
					{
						DBG_LWIP("Failed to parse request! (ret = %d)\r\n", xResultHTTP);
					}
					http_print_msg((lwhttp_message_t*)&client_request);

					/* Run LwHTTP Response Parser */
					xResultHTTP = lwhttp_response_parse(&client_response);
					if (pdTRUE != xResultHTTP)
					{
						DBG_LWIP("Failed to parse response! (ret = %d)\r\n", xResultHTTP);
					}
					http_print_msg((lwhttp_message_t*)&client_response);

					sd_log_entry_set_sent(xEntry.ulID);

					/* If HTTP Status Code is OK (200) and Content-Type is JSON */
					if ((0 == strncmp(client_response.start_line.status_line.status_code.data, "200", strlen("200")))
							&& (0 == strncmp(content_type_header_ptr->field_value.data, "application/json", strlen("application/json")))
							&& (1 < client_response.message_body.len))
					{
						/* Parse LwHTTP Response message body as JSON */
						if (pdTRUE != parse_thingspeak_rsp(client_response.message_body.data, client_response.message_body.len))
						{
							DBG_LWIP("Failed to parse JSON\r\n");
						}
					}
					else
					{
						DBG_LWIP("Invalid response\r\n");
					}
				}
				else
				{
					DBG_LWIP("Failed to POST\r\n");
				}

				/* Free LwHTTP Request & Response */
				lwhttp_request_free(&client_request);
				lwhttp_response_free(&client_response);
			}
			else if(xQueueReceive(getIPQueueHandle, &queueData, 0) == pdTRUE)
			{
				DBG_QUEUE("getIPQueueHandle\r\n");

				strcpy(ip4_addr_ptr, ip4addr_ntoa((const ip4_addr_t *)&netif->ip_addr));

				if(xQueueSend(setIPQueueHandle, &ip4_addr_ptr, 0) == pdTRUE)
				{
					DBG_QUEUE("setIPQueueHandle = %s\r\n", ip4_addr_ptr);
				}
			}
			else
#endif
			{
				osDelay(10);
			}
		}
		break;
		default:
		{
			osDelay(10);
		}
		break;
		}
	}
	/* USER CODE END HTTP_Client_Task */
}

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM6 interrupt took place, inside
 * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
 * a global variable "uwTick" used as application time base.
 * @param  htim : TIM handle
 * @retval None
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	/* USER CODE BEGIN Callback 0 */

	/* USER CODE END Callback 0 */
	if (htim->Instance == TIM6) {
		HAL_IncTick();
	}
	/* USER CODE BEGIN Callback 1 */

	/* USER CODE END Callback 1 */
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */

	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{ 
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
